app/controllers/application_controller.rb

  def set_current_account
    account_id = params[:account_id] || params.dig(:acc_transaction, :account_id)
    @current_account = Account.find_by(id: account_id) || Account.first
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def set_current_expense
    expense_id = params[:expense_id] || params.dig(:acc_transaction, :expense_id)
    @current_expense = Expense.find_by(id: expense_id)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" IS NULL LIMIT ?  [["LIMIT", 1]]