app/controllers/dashboard_controller.rb

    def index
      @accounts = current_user.accounts.order(:order)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? ORDER BY "accounts"."order" ASC  [["user_id", 1]]